In [37]:
import pandas as pd

data = {
    "Name": ["Amit", "Riya", "Arjun", "Neha", "Karan", "hello"],
    "Math": [85, None, 90, 67, 88, 75],
    "Science": [88, 81, None, 73, 77, 69],
    "English": [92, 74, 89, None, 91, 70]
}
df=pd.DataFrame(data)
df

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
1   Riya   NaN     81.0     74.0
2  Arjun  90.0      NaN     89.0
3   Neha  67.0     73.0      NaN
4  Karan  88.0     77.0     91.0
5  hello  75.0     69.0     70.0

In [4]:
df.isnull() #checks if missing value exists

    Name   Math  Science  English
0  False  False    False    False
1  False   True    False    False
2  False  False     True    False
3  False  False    False     True
4  False  False    False    False
5   True  False    False    False

In [5]:
df.isnull().sum() #checks missing values per column

Name       1
Math       1
Science    1
English    1
dtype: int64

In [10]:
df.isnull().sum().sum() #checks total missign values

np.int64(4)

In [11]:
df.notnull() #checks non-missing values

    Name   Math  Science  English
0   True   True     True     True
1   True  False     True     True
2   True   True    False     True
3   True   True     True    False
4   True   True     True     True
5  False   True     True     True

In [13]:
df[df.isnull().any(axis=1)] #checks which row has missing value

    Name  Math  Science  English
1   Riya   NaN     81.0     74.0
2  Arjun  90.0      NaN     89.0
3   Neha  67.0     73.0      NaN
5   None  75.0     69.0     70.0

In [23]:
hello=df.isnull().sum()==0
#print(hello)
c=df.columns[hello]
print(c) #prints columns which has all non zero values

Index(['Name'], dtype='object')

In [30]:
hel=(df.isnull().sum()>0).sum() #gves no of columns which has atleat 1 missing value
print(hel)

3

In [35]:
print("Percentage of missing values per column:\n")
print(df.isnull().sum() / len(df)*100)

Percentage of missing values per column:

Name        0.000000
Math       16.666667
Science    16.666667
English    16.666667
dtype: float64

In [38]:
import pandas as pd

data = {
    "Name": ["Amit", "Riya", "Arjun", "Neha", "Karan", None],
    "Math": [85, None, 90, 67, 88, 75],
    "Science": [88, 81, None, 73, 77, 69],
    "English": [92, 74, 89, None, 91, 70]
}

he = pd.DataFrame(data)
print(he)

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
1   Riya   NaN     81.0     74.0
2  Arjun  90.0      NaN     89.0
3   Neha  67.0     73.0      NaN
4  Karan  88.0     77.0     91.0
5   None  75.0     69.0     70.0

In [39]:
clean=he.dropna() #removes row with any null values

print(clean)

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
4  Karan  88.0     77.0     91.0

In [41]:
he.dropna(inplace=True) #permanently removes mising value row from the original table
print(he)

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
4  Karan  88.0     77.0     91.0

In [43]:
he = pd.DataFrame(data) 
he.dropna(axis=1,inplace=False) #deletes columns with null

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [47]:
df1=df.fillna(2) #replace null values with 2
df1

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
1   Riya   2.0     81.0     74.0
2  Arjun  90.0      2.0     89.0
3   Neha  67.0     73.0      2.0
4  Karan  88.0     77.0     91.0
5  hello  75.0     69.0     70.0

In [50]:
he = pd.DataFrame(data)#reload original data
he

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
1   Riya   NaN     81.0     74.0
2  Arjun  90.0      NaN     89.0
3   Neha  67.0     73.0      NaN
4  Karan  88.0     77.0     91.0
5   None  75.0     69.0     70.0

In [54]:
df2=he.fillna({
    "Name":"unknown",
    "Math":he["Math"].mean(),
    "Science": he["Science"].mean()})
df2 #fills missing data with custom value

      Name  Math  Science  English
0     Amit  85.0     88.0     92.0
1     Riya  81.0     81.0     74.0
2    Arjun  90.0     77.6     89.0
3     Neha  67.0     73.0      NaN
4    Karan  88.0     77.0     91.0
5  unknown  75.0     69.0     70.0

In [55]:
he = pd.DataFrame(data)#reload original data
he

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
1   Riya   NaN     81.0     74.0
2  Arjun  90.0      NaN     89.0
3   Neha  67.0     73.0      NaN
4  Karan  88.0     77.0     91.0
5   None  75.0     69.0     70.0

In [58]:
he.fillna(method='ffill') #fills null values with previous values
he.fillna(method='bfill')

C:\Users\HP PROBOOK RYZEN 7\AppData\Local\Temp\ipykernel_8576\570189718.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  he.fillna(method='ffill') #fills null values with previous values
C:\Users\HP PROBOOK RYZEN 7\AppData\Local\Temp\ipykernel_8576\570189718.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  he.fillna(method='bfill') #fills null values with next values

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
1   Riya  90.0     81.0     74.0
2  Arjun  90.0     73.0     89.0
3   Neha  67.0     73.0     91.0
4  Karan  88.0     77.0     91.0
5   None  75.0     69.0     70.0

In [62]:
he = pd.DataFrame(data)#reload original data
he

    Name  Math  Science  English
0   Amit  85.0     88.0     92.0
1   Riya   NaN     81.0     74.0
2  Arjun  90.0      NaN     89.0
3   Neha  67.0     73.0      NaN
4  Karan  88.0     77.0     91.0
5   None  75.0     69.0     70.0

In [63]:
import pandas as pd

data = {
    "Name": ["Amit ", "Riya", "ARJUN", "neha", "Karan", "Unknown"],
    "Math_Score": [85, 78, 90, 67, "88", None],
    "Science_Score": [88, "81", 95, "N/A", 77, 69],
    "English_Score": [92, 74, "89", 70, 91, "missing"]
}

df = pd.DataFrame(data)
print(df)

      Name Math_Score Science_Score English_Score
0    Amit          85            88            92
1     Riya         78            81            74
2    ARJUN         90            95            89
3     neha         67           N/A            70
4    Karan         88            77            91
5  Unknown       None            69       missing

In [67]:
df.rename(columns={ #changing column name 
    "Math_Score": "maths",
    "Science_Score": "science",
    "English_Score": "english"},inplace=True)
print(df.columns)

Index(['Name', 'maths', 'science', 'english'], dtype='object')

In [75]:
import numpy as np #Replace wrong string values with NaN

df.replace(["N/A", "missing", None], np.nan, inplace=True)
print(df)

      Name maths science english
0    Amit     85      88      92
1     Riya    78      81      74
2    ARJUN    90      95      89
3     neha    67     NaN      70
4    Karan    88      77      91
5  Unknown   NaN      69     NaN

In [76]:
df["maths"]=pd.to_numeric(df["maths"],errors='coerce')     #Convert column types (numbers as strings â†’ float)
df["science"]=pd.to_numeric(df["science"],errors='coerce')
df["english"]=pd.to_numeric(df["english"],errors='coerce')

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   maths    5 non-null      float64
 2   science  5 non-null      float64
 3   english  5 non-null      float64
dtypes: float64(3), object(1)
memory usage: 324.0+ bytes

In [78]:
df["Name"]=df["Name"].str.strip()   #Remove extra spaces
df["Name"] = df["Name"].str.title()  #Convert all names to title case

In [79]:
df

      Name  maths  science  english
0     Amit   85.0     88.0     92.0
1     Riya   78.0     81.0     74.0
2    Arjun   90.0     95.0     89.0
3     Neha   67.0      NaN     70.0
4    Karan   88.0     77.0     91.0
5  Unknown    NaN     69.0      NaN

In [82]:
df["maths"].fillna(df["maths"].mean(),inplace=True)#Fill missing marks with mean

C:\Users\HP PROBOOK RYZEN 7\AppData\Local\Temp\ipykernel_8576\602669797.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["maths"].fillna(df["maths"].mean(),inplace=True)

      Name  maths  science  english
0     Amit   85.0     88.0     92.0
1     Riya   78.0     81.0     74.0
2    Arjun   90.0     95.0     89.0
3     Neha   67.0      NaN     70.0
4    Karan   88.0     77.0     91.0
5  Unknown   81.6     69.0      NaN

In [85]:
df = df.round(1)
print(df)

      Name  maths  science  english
0     Amit   85.0     88.0     92.0
1     Riya   78.0     81.0     74.0
2    Arjun   90.0     95.0     89.0
3     Neha   67.0      NaN     70.0
4    Karan   88.0     77.0     91.0
5  Unknown   81.6     69.0      NaN

In [86]:
import pandas as pd

# ðŸ‘‡ Practice DataFrame for your final formatting task
data = {
    "Name": ["Amit", "Riya", "ARJUN", "neha", "Karan", "Unknown"],
    "Math": [85.457, 78.331, 90.987, 67.002, 88.756, 81.632],
    "Science": [88.23, 81.77, 95.564, 82.12, 77.66, 69.12],
    "English": [92.01, 74.48, 89.999, 70.42, 91.55, 83.25]
}

df = pd.DataFrame(data)
print("ðŸ”¹ Original Table:")
print(df)

ðŸ”¹ Original Table:
      Name    Math  Science  English
0     Amit  85.457   88.230   92.010
1     Riya  78.331   81.770   74.480
2    ARJUN  90.987   95.564   89.999
3     neha  67.002   82.120   70.420
4    Karan  88.756   77.660   91.550
5  Unknown  81.632   69.120   83.250

In [87]:
df["Name"]=df["Name"].str.upper()
print(df)

      Name    Math  Science  English
0     AMIT  85.457   88.230   92.010
1     RIYA  78.331   81.770   74.480
2    ARJUN  90.987   95.564   89.999
3     NEHA  67.002   82.120   70.420
4    KARAN  88.756   77.660   91.550
5  UNKNOWN  81.632   69.120   83.250

In [89]:
df.replace('UNKNOWN','Not Provided', inplace=True) #changed a certain value to another name 
print(df)

           Name    Math  Science  English
0          AMIT  85.457   88.230   92.010
1          RIYA  78.331   81.770   74.480
2         ARJUN  90.987   95.564   89.999
3          NEHA  67.002   82.120   70.420
4         KARAN  88.756   77.660   91.550
5  Not Provided  81.632   69.120   83.250

In [95]:
df.to_csv("cleaned_students.csv",index=False) #converted to csv file

In [96]:
import pandas as pd

data = {
    "Name": ["Amit", "Riya", "Arjun", "Riya", "Karan", "Amit"],
    "Math": [85, 78, 90, 78, 88, 85],
    "Science": [88, 81, 95, 81, 77, 88],
    "English": [92, 74, 89, 74, 91, 92]
}

df = pd.DataFrame(data)
print("ðŸ”¹ Original Data:")
print(df)

ðŸ”¹ Original Data:
    Name  Math  Science  English
0   Amit    85       88       92
1   Riya    78       81       74
2  Arjun    90       95       89
3   Riya    78       81       74
4  Karan    88       77       91
5   Amit    85       88       92

In [97]:
df.duplicated() #checks duplicate rows

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [99]:
df.duplicated().sum()#counts duplicate rows

np.int64(2)

In [100]:
df[df.duplicated()] #shows only duplicate rows

   Name  Math  Science  English
3  Riya    78       81       74
5  Amit    85       88       92

In [102]:
df1=df.drop_duplicates() #removes duplicate rows 
print(df1)

    Name  Math  Science  English
0   Amit    85       88       92
1   Riya    78       81       74
2  Arjun    90       95       89
4  Karan    88       77       91

In [103]:
df2=df.drop_duplicates(keep='last') #deletes all duplicate row but keeps the last one
df2

    Name  Math  Science  English
2  Arjun    90       95       89
3   Riya    78       81       74
4  Karan    88       77       91
5   Amit    85       88       92

In [105]:
df2.reset_index(drop=True,inplace=True) #fixed indexing
print(df2)

    Name  Math  Science  English
0  Arjun    90       95       89
1   Riya    78       81       74
2  Karan    88       77       91
3   Amit    85       88       92

In [1]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Amit ", "Riya", "Arjun", "Riya", "Karan", "Unknown", "Amit "],
    "Math": [85, np.nan, 90, 78, 88, "N/A", 85],
    "Science": [88, 81, "N/A", 81, 77, 69, 88],
    "English": [92, "missing", 89, 74, 91, 83, 92]
}

df = pd.DataFrame(data)
print( "ðŸ”¹ Original Messy Data:" )
print(df)

ðŸ”¹ Original Messy Data:
      Name Math Science  English
0    Amit    85      88       92
1     Riya  NaN      81  missing
2    Arjun   90     N/A       89
3     Riya   78      81       74
4    Karan   88      77       91
5  Unknown  N/A      69       83
6    Amit    85      88       92